

      
     Internet Engineering Task Force                              J. Elwell 
     Internet Draft                                                 Siemens 
                                                                   F. Derks 
                                                                    Philips 
                                                      P. Mourot/O. Rousseau 
     draft-elwell-sipping-qsig2sip-02.txt                           Alcatel 
     Expires: February 2003                                     August 2002 
      
                                           
                          Interworking between SIP and QSIG 
          
     Status of this Memo  
         
        This document is an Internet-Draft and is subject to all provisions 
        of Section 10 of RFC2026 except that the right to produce derivative 
        works is not granted. 
             
        Internet-Drafts are working documents of the Internet Engineering 
        Task Force (IETF), its areas, and its working groups. Note that other 
        groups may also distribute working documents as Internet-Drafts. 
             
        Internet-Drafts are draft documents valid for a maximum of six months 
        and may be updated, replaced, or obsoleted by other documents at any 
        time. It is inappropriate to use Internet-Drafts as reference 
        material or to cite them other than as "work in progress."  
             
        The list of current Internet-Drafts can be accessed at  
             http://www.ietf.org/ietf/1id-abstracts.txt  
        The list of Internet-Draft Shadow Directories can be accessed at  
             http://www.ietf.org/shadow.html.  
             
     Abstract  
         
        This document specifies interworking between the Session Initiation 
        Protocol (SIP) and QSIG within corporate networks. SIP is an Internet 
        application-layer control (signalling) protocol for creating, 
        modifying, and terminating sessions with one or more participants. 
        These sessions include, in particular, telephone calls. QSIG is a 
        signalling protocol for creating, modifying and terminating circuit-
        switched calls, in particular telephone calls, within Private 
        Integrated Services Networks (PISNs). QSIG is specified in a number 
        of ECMA Standards and published also as ISO/IEC standards. 
      

        As the support of telephony within corporate networks evolves from 
        circuit-switched technology to Internet technology, the two 
        technologies will co-exist in many networks for a period, perhaps 
        several years. Therefore there is a need to be able to establish, 
        modify and terminate sessions involving a participant in the SIP 

      
      
     Elwell et alia         Expires - February 2003               [Page 1] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        network and a participant in the QSIG network. Such calls are 
        supported by gateways that perform interworking between SIP and QSIG. 
      

        This document is a product of the authors' activities in ECMA 
        (www.ecma.ch) on interoperability of QSIG with IP networks. 
           
        1 Introduction....................................................3 
        2 Terminology.....................................................4 
        3 Definitions.....................................................4 
        3.1 External definitions..........................................4 
        3.2 Other definitions.............................................5 
        3.2.1 Gateway.....................................................5 
        3.2.2 IP network..................................................5 
        3.2.3 Media stream................................................5 
        4 Acronyms........................................................5 
        5 Background and architecture.....................................5 
        6 Overview........................................................8 
        7 General requirements............................................9 
        8 Message mapping requirements...................................10 
        8.1 Message validation and handling of protocol errors...........10 
        8.2 Call establishment from QSIG to SIP..........................11 
        8.2.1 Call establishment from QSIG to SIP using enbloc procedures11 
        8.2.1.1 Receipt of QSIG SETUP message............................12 
        8.2.1.2 Receipt of SIP 100 (Trying) response.....................12 
        8.2.1.3 Receipt of SIP 18x provisional response..................12 
        8.2.1.4 Receipt of SIP 2xx response..............................13 
        8.2.1.5 Receipt of SIP 3xx response..............................14 
        8.2.2 Call establishment from QSIG to SIP using overlap procedures14 
        8.2.2.1 Enbloc signalling in SIP network.........................14 
        8.2.2.1.1 Receipt of QSIG SETUP message..........................14 
        8.2.2.1.2 Receipt of QSIG INFORMATION message....................15 
        8.2.2.1.3 Receipt of SIP responses...............................15 
        8.2.2.2 Overlap signalling in SIP network........................15 
        8.2.2.2.1 Receipt of QSIG SETUP message..........................15 
        8.2.2.2.2 Receipt of QSIG INFORMATION message....................15 
        8.2.2.2.3 Receipt of SIP 100 (Trying) response...................16 
        8.2.2.2.4 Receipt of SIP 18x provisional response................16 
        8.2.2.2.5 Receipt of SIP 2xx response............................16 
        8.2.2.2.6 Receipt of SIP 3xx response............................16 
        8.2.2.2.7 Receipt of a SIP 484 (Address Incomplete) response.....16 
        8.2.2.2.8 Receipt of a SIP 4xx (except 484), 5xx or 6xx response.16 
        8.2.2.2.9 Receipt of multiple SIP responses......................17 
        8.2.2.2.10 Cancelling pending SIP INVITE transactions............17 
        8.2.2.2.11 SIP INVITE requests reaching multiple gateways........17 
        8.3 Call Establishment from SIP to QSIG..........................18 
        8.3.1 Receipt of SIP INVITE request for a new call...............18 
        8.3.2 Receipt of QSIG CALL PROCEEDING message....................19 
        8.3.3 Receipt of QSIG PROGRESS message...........................19 
        8.3.4 Receipt of QSIG ALERTING message...........................19 
      
      
     Elwell et alia         Expires - February 2003               [Page 2] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        8.3.5 Inclusion of SDP information in a SIP 18x provisional response
        .................................................................20 
        8.3.6 Receipt of QSIG CONNECT message............................21 
        8.3.7 Receipt of SIP PRACK request...............................21 
        8.3.8 Receipt of SIP ACK request.................................22 
        8.3.9 Receipt of a SIP INVITE request for a call already being 
        established......................................................22 
        8.4 Call clearing................................................22 
        8.4.1 Receipt of a QSIG DISCONNECT, RELEASE or RELEASE COMPLETE 
        message..........................................................22 
        8.4.2 Receipt of a SIP BYE request...............................25 
        8.4.3 Receipt of a SIP CANCEL request............................25 
        8.4.4 Receipt of a SIP 4xx - 6xx response........................25 
        8.4.5 Gateway-initiated call clearing............................27 
        8.5 Request to change media characteristics......................27 
        9 Number mapping.................................................28 
        9.1 Mapping from SIP to QSIG.....................................28 
        9.2 Mapping from QSIG to SIP.....................................28 
        10 Requirements for support of basic services....................28 
        10.1 Derivation of QSIG Bearer capability information element....28 
        10.2 Derivation of media type in SDP.............................29 
        11 Security considerations.......................................29 
        12 Author's Addresses............................................30 
        13 Normative References..........................................30 
        Annex A û Example message sequences..............................31 
        Annex B û Change log.............................................44 
         
         
     1 Introduction  
         
        This document specifies signalling interworking between "QSIG" and 
        the Session Initiation Protocol (SIP) in support of basic services 
        within a corporate telecommunication network (CN). 
         
        "QSIG" is a signalling protocol that operates between Private 
        Integrated Services eXchanges (PINX) within a Private Integrated 
        Services Network (PISN). A PISN provides circuit-switched basic 
        services and supplementary services to its users. QSIG is specified 
        in ECMA Standards, in particular ECMA-143 (call control in support of 
        basic services), ECMA-165 (generic functional protocol for the 
        support of supplementary services) and a number of Standards 
        specifying individual supplementary services. 
         
        SIP is an application layer protocol for establishing, terminating 
        and modifying multimedia sessions. It is typically carried over IP. 
        Telephone calls are considered as a type of multimedia session where 
        just audio is exchanged. SIP is defined in IETF RFC 3261. 
         

      
      
     Elwell et alia         Expires - February 2003               [Page 3] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        This document specifies signalling interworking for basic services 
        that provide a bi-directional transfer capability for speech, DTMF, 
        facsimile and modem media between a PISN employing QSIG and a 
        corporate IP network employing SIP. Call-related and call-independent 
        signalling in support of supplementary services is outside the scope 
        of this specification, but support for certain supplementary services 
        (e.g., call transfer, call diversion) could be the subject of future 
        work. 
         
        Interworking between QSIG and SIP permits a call originating at a 
        user of a PISN to terminate at a user of a corporate IP network, or a 
        call originating at a user of a corporate IP network to terminate at 
        a user of a PISN. 
         
        Interworking between a PISN employing QSIG and a public IP network 
        employing SIP is outside the scope of this specification. However, 
        the functionality specified in this specification is in principle 
        applicable to such a scenario when deployed in conjunction with other 
        relevant functionality (e.g., number translation, security functions, 
        etc.). 
         
        This specification is applicable to any interworking unit that can 
        act as a gateway between a PISN employing QSIG and a corporate IP 
        network employing SIP. 
         
             
     2 Terminology  
         
        In this document, the key words "MUST", "MUST NOT", "REQUIRED", 
        "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", 
        and "OPTIONAL" are to be interpreted as described in RFC 2119 [2] and 
        indicate requirement levels for compliant SIP implementations.  
             
     3 Definitions 
      
        For the purposes of this specification, the following definitions 
        apply. 
         
     3.1 External definitions 
         
        This specification uses the following terms defined in other 
        documents: 
         
        -Call (ECMA-307) 
        -Corporate telecommunication network (CN) (ECMA-307) 
        -Private Integrated Services Network (PISN) (ECMA-307) 
        -Private Integrated services Network eXchange (PINX) (ECMA-133) 
         

      
      
     Elwell et alia         Expires - February 2003               [Page 4] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        Additionally the definitions in ECMA-143 and IETF RFC 3261 apply as 
        appropriate. 
         
     3.2 Other definitions 
         
     3.2.1 Gateway 
         
        An entity that performs interworking between a PISN using QSIG and an 
        IP network using SIP. 
         
     3.2.2 IP network 
         
        A network, unless otherwise stated a corporate network, offering 
        connectionless packet-mode services based on the Internet Protocol 
        (IP) as the network layer protocol. 
         
     3.2.3 Media stream 
         
        Audio or other user information transmitted in UDP packets, typically 
        containing RTP, in a single direction between the gateway and a peer 
        entity participating in a session established using SIP. 
         
        NOTE. Normally a SIP session establishes a pair of media streams, one 
        in each direction. 
         
     4 Acronyms 
         
        DNS   Domain Name Service 
        PINX  Private Integrated services Network eXchange 
        PISN  Private Integrated Services Network 
        RTP   Real-time Transport Protocol 
        SCTP  Stream Control Transmission Protocol 
        SDP   Session Description Protocol 
        SIP   Session Initiation Protocol 
        TCP   Transmission Control Protocol 
        TLS   Transport Layer Security 
        TU    Transaction User 
        UA    User Agent 
        UAC   User Agent Client 
        UAS   User Agent Server 
        UDP   User Datagram Protocol 
         
     5 Background and architecture 
         
        During the 1980s, voice telecommunications in enterprises adopted 
        technology similar in principle to Integrated Services Digital 
        Neworks (ISDN). Digital circuit switches, commonly known as Private 
        Branch eXchanges (PBX) or more formally as Private Integrated 
        services Network eXchanges (PINX) have been interconnected by digital 
      
      
     Elwell et alia         Expires - February 2003               [Page 5] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        transmission systems to form Private Integrated Services Networks 
        (PISN). These digital transmission systems carry voice or other 
        payload in fixed rate channels, typically 64 Kbit/s, and signalling 
        in a separate channel. A technique known as common channel signalling 
        is employed, whereby a single signalling channel potentially controls 
        a number of payload channels or bearer channels. A typical 
        arrangement is a point-to-point transmission facility at T1 or E1 
        rate providing a 64 Kbit/s signalling channel and 24 or 30 bearer 
        channels respectively. Other arrangements are possible and have been 
        deployed, including the use of multiple transmission facilities for a 
        signalling channel and its logically associated bearer channels. Also 
        arrangements involving bearer channels at sub-64 Kbit/s have been 
        deployed, where voice payload requires the use of codecs that perform 
        compression. 
         
        QSIG is the internationally-standardized message-based signalling 
        protocol for use in networks as described above. It runs in a 
        signalling channel between two PINXs and controls calls on a number 
        of logically associated bearer channels between the same two PINXs. 
        The signalling channel and its logically associated bearer channels 
        are collectively known as an inter-PINX link. QSIG is independent of 
        the type of transmission capabilities over which the signalling 
        channel and bearer channels are provided. QSIG is also independent of 
        the transport protocol used to transport QSIG messages reliably over 
        the signalling channel. 
         
        QSIG provides a means for establishing and clearing calls that 
        originate and terminate on different PINXs. A call can be routed over 
        a single inter-PINX link connecting the originating and terminating 
        PINX, or over several inter-PINX links in series with switching at 
        intermediate PINXs known as transit PINXs. A call can originate or 
        terminate in another network, in which case it enters or leaves the 
        PISN environment through a gateway PINX. Parties are identified by 
        numbers, in accordance with either ITU-T recommendation E.164 or a 
        private numbering plan. This basic call capability is specified in 
        ECMA-143. In addition to basic call capability, QSIG specifies a 
        number of further capabilities supporting the use of supplementary 
        services in PISNs. 
         
        More recently enterprise telecommunications networks have started to 
        exploit IP in various ways. One way is to migrate part of the network 
        to IP using SIP. This might, for example, be a new branch office with 
        a SIP proxy and SIP endpoints instead of a PINX. Alternatively, SIP 
        equipment might be used to replace an existing PINX or PINXs. The new 
        SIP environment needs to interwork with the QSIG-based PISN in order 
        to support calls originating in one environment and terminating in 
        the other. Interworking is achieved through a gateway. 
         

      
      
     Elwell et alia         Expires - February 2003               [Page 6] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        Another way of migrating is to use a SIP network to interconnect two 
        parts of a PISN and encapsulate QSIG signalling in SIP messages for 
        calls between the two parts of the PISN. This is outside the scope of 
        this specification but could be the subject of future work. 
         
        This document specifies signalling protocol interworking aspects of a 
        gateway between a PISN employing QSIG signalling and an IP network 
        employing SIP signalling. The gateway appears as a PINX to other 
        PINXs in the PISN. The gateway appears as a SIP endpoint to other SIP 
        entities in the IP network. The environment is shown in figure 1. 
         
              +------+   IP network                    PISN 
              |      |                                                        
              |SIP   |                                               +------+ 
              |Proxy |                                              /|      | 
              |      |                                             / |PINX  | 
              +---+--+               *-----------+                /  |      | 
                  |                  |           |        +-----+/   +------+ 
                  |                  |           |        |     |             
                  |                  |           |        |PINX |             
        ----+-----+---------+--------+  Gateway  +--------|     |             
            |               |        |           |        |     |\            
            |               |        |           |        +-----+ \           
            |               |        |           |                 \ +------+ 
            |               |        |           |                  \|      | 
         +--+---+        +--+---+    *-----------+                   |PINX  | 
         |SIP   |        |SIP   |                                    |      | 
         |End-  |        |End-  |                                    +------+ 
         |point |        |point |                                             
         +------+        +------+ 
         
        Figure 1 û Environment 
         
        In addition to the signalling interworking functionality specified in 
        this specification, it is assumed that the gateway also includes the 
        following functionality: 
         
        -one or more physical interfaces on the PISN side supporting one or 
        more inter-PINX links, each link providing one or more constant bit 
        rate channels for media information and a reliable layer 2 connection 
        for transporting QSIG signalling messages; and 
         
        -one or more physical interfaces on the IP network side supporting, 
        through layer 1 and layer 2 protocols, IP as the network layer 
        protocol and UDP (RFC 768) and TCP (RFC 761) as transport layer 
        protocols, these being used for the transport of SIP signalling 
        messages and, in the case of UDP, also for media information; 
         

      
      
     Elwell et alia         Expires - February 2003               [Page 7] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        -optionally the support of TLS (RFC 2246) and/or SCTP (RFC 2960) as 
        additional transport layer protocols on the IP network side, these 
        being used for the transport of SIP signalling messages; and 
         
        -a means of transferring media information in each direction between 
        the PISN and the IP network, including as a minimum packetization of 
        media information sent to the IP network and de-packetization of 
        media information received from the IP network. 
         
        NOTE. RFC 3261 mandates support for both UDP and TCP for the 
        transport of SIP messages and allows optional support for TLS and/or 
        SCTP for this same purpose. 
         
        The protocol model relevant to signalling interworking functionality 
        of a gateway is shown in figure 2. 
         
              +---------------------------------------------------------+ 
              |                  Inter-working function                 | 
              |                                                         | 
              +-----------------------+---------+-----------------------+ 
              |                       |         |                       | 
              |        SIP            |         |                       | 
              |                       |         |                       | 
              +-----------------------+         |                       | 
              |                       |         |                       | 
              |  UDP/TCP/TLS/SCTP     |         |        QSIG           | 
              |                       |         |                       | 
              +-----------------------+         |                       | 
              |                       |         |                       | 
              |        IP             |         |                       | 
              |                       |         |                       | 
              +-----------------------+         +-----------------------+ 
              |    IP network         |         |        PISN           | 
              |    lower layers       |         |    lower layers       | 
              |                       |         |                       | 
              +-----------------------+         +-----------------------+ 
         
        Figure 2 û Protocol model 
         
        In figure 2, the SIP box represents SIP syntax and encoding, the SIP 
        transport layer and the SIP transaction layer. The Interworking 
        function includes SIP Transaction User (TU) functionality. 
         
     6 Overview 
         
        The gateway maps received QSIG messages, where appropriate, to SIP 
        messages and vice versa and maintains an association between a QSIG 
        call and a SIP dialog. 
         
      
      
     Elwell et alia         Expires - February 2003               [Page 8] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        A call from QSIG to SIP is initiated when a QSIG SETUP message 
        arrives at the gateway. The QSIG SETUP message initiates QSIG call 
        establishment and an initial responding message completes negotiation 
        of the bearer channel to be used for that call. The gateway then 
        sends a SIP INVITE request, having translated the QSIG called party 
        number to a URI suitable for inclusion in the Request-URI. The SIP 
        INVITE request and the resulting SIP dialog, if successfully 
        established, are associated with the QSIG call. The SIP 200 OK 
        response is mapped to a QSIG CONNECT message, signifying answer of 
        the call. During establishment, media streams established by SIP and 
        SDP are connected to the bearer channel. 
         
        A call from SIP to QSIG is initiated when a SIP INVITE request 
        arrives at the gateway. The gateway sends a QSIG SETUP message to 
        initiate QSIG call establishment, having translated the SIP 
        Request-URI to a number suitable for use as the QSIG called party 
        number. The resulting QSIG call is associated with the SIP INVITE 
        request and with the eventual SIP dialog. Receipt of an initial QSIG 
        responding message completes negotiation of the bearer channel to be 
        used, allowing media streams established by SIP and SDP to be 
        connected to that bearer channel. The QSIG CONNECT message is mapped 
        to a SIP 200 OK response. 
         
        Annex A gives examples of typical message sequences that can arise. 
         
     7 General requirements 
         
        In order to conform to this specification, a gateway SHALL support 
        QSIG in accordance with ECMA-143 as a gateway and SHALL support SIP 
        in accordance with IETF RFC 3261 as a UA. In particular the gateway 
        SHALL support SIP syntax and encoding, the SIP transport layer and 
        the SIP transaction layer in accordance with RFC 3261. In addition, 
        the gateway SHALL support SIP TU behaviour for a UA in accordance 
        with RFC 3261 except where stated otherwise in this specification. 
         
        NOTE 1. RFC 3261 mandates that a SIP entity support both UDP and TCP 
        as transport layer protocols for SIP messages. Other transport layer 
        protocols can also be supported. 
         
        The gateway SHALL also support SIP reliable provisional responses in 
        accordance with IETF RFC 3262 as a UA. 
         
        NOTE 2. RFC 3262 makes provision for recovering from loss of 
        provisional responses (other than 100) to INVITE requests when using 
        unreliable transport services in the IP network. This is important 
        for ensuring delivery of responses that map to essential QSIG 
        messages. 
         

      
      
     Elwell et alia         Expires - February 2003               [Page 9] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        The gateway SHALL support SDP in accordance with RFC 2327 and its use 
        in accordance with the offer / answer model in RFC 3264. 
         
        The gateway SHALL support calls from QSIG to SIP and calls from SIP 
        to QSIG. 
         
        SIP methods not defined in RFC 3261 or RFC 3262 are outside the scope 
        of this specification but could be the subject of other 
        specifications for interworking with QSIG, e.g., for interworking in 
        support of supplementary services. 
         
        As a result of DNS look-up by the gateway in order to determine where 
        to send a SIP INVITE request, a number of candidate destinations can 
        be attempted in sequence. The way in which this is handled by the 
        gateway is outside the scope of this specification. However, any 
        behaviour specified in this document on receipt of a SIP final 
        response SHOULD apply only when a final response is received and 
        there are no more candidate destinations to try. 
         
     8 Message mapping requirements 
         
     8.1 Message validation and handling of protocol errors 
         
        The gateway SHALL validate received QSIG messages in accordance with 
        the requirements of ECMA-143 and SHALL act in accordance with 
        ECMA-143 on detection of a QSIG protocol error. The requirements of 
        this section for acting on a received QSIG message apply only to a 
        received QSIG message that has been successfully validated and that 
        satisfies one of the following conditions: 
         
        -the QSIG message is a SETUP message and indicates a destination in 
        the IP network and a bearer capability for which the gateway is able 
        to provide interworking; or 
         
        -the QSIG message is a message other than SETUP and contains a call 
        reference that identifies an existing call for which the gateway is 
        providing interworking between QSIG and SIP. 
         
        The processing of any valid QSIG message that does not satisfy any of 
        these conditions is outside the scope of this specification. 
         
        The gateway SHALL validate received SIP messages (requests and 
        responses) in accordance with the requirements of IETF RFC 3261 and 
        SHALL act in accordance with IETF RFC 3261 on detection of a SIP 
        protocol error. Requirements of this section for acting on a received 
        SIP message apply only to a received message that has been 
        successfully validated and that satisfies one of the following 
        conditions: 
         
      
      
     Elwell et alia         Expires - February 2003              [Page 10] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        -the SIP message is an INVITE request that contains no tag parameter 
        in the To header field, does not match an ongoing transaction (i.e., 
        is not a merged request, see 8.2.2.2 of RFC 3261) and indicates a 
        destination in the PISN for which the gateway is able to provide 
        interworking; or 
         
        -the SIP message is a request that relates to an existing dialog 
        representing a call for which the gateway is providing interworking 
        between QSIG and SIP; or 
         
        -the SIP message is a CANCEL request that relates to a received 
        INVITE request for which the gateway is providing interworking with 
        QSIG but for which the only response sent is informational (1xx), no 
        dialog having been confirmed; or 
         
        -the SIP message is a response to a request sent by the gateway in 
        accordance with this section. 
         
        The processing of any valid SIP message that does not satisfy any of 
        these conditions is outside the scope of this specification. 
         
        NOTE. These rules mean that an error detected in a received message 
        will not be propagated to the other side of the gateway. However, 
        there can be an indirect impact on the other side of the gateway, 
        e.g., the initiation of call clearing procedures. 
         
        The gateway SHALL run QSIG protocol timers as specified in ECMA-143 
        and SHALL act in accordance with ECMA-143 if a QSIG protocol timer 
        expires. Any other action on expiry of a QSIG protocol timer is 
        outside the scope of this specification, except that if it results in 
        the clearing of the QSIG call, the gateway SHALL also clear the SIP 
        call in accordance with 8.4.5. 
         
        The gateway SHALL run SIP protocol timers as specified in RFC 3261 
        and SHALL act in accordance with RFC 3261 if a SIP protocol timer 
        expires. Any other action on expiry of a SIP protocol timer is 
        outside the scope of this specification, except that if it results in 
        the clearing of the SIP call, the gateway SHALL also clear the QSIG 
        call in accordance with 8.4.5. 
         
     8.2 Call establishment from QSIG to SIP 
     8.2.1 Call establishment from QSIG to SIP using enbloc procedures 
         
        The following procedures apply when the gateway receives a QSIG SETUP 
        message containing a Sending Complete information element or the 
        gateway receives a QSIG SETUP message and is able to determine that 
        the number in the Called party number information element is 
        complete. 
         
      
      
     Elwell et alia         Expires - February 2003              [Page 11] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        NOTE. The means by which the gateway determines the number to be 
        complete is an implementation matter. It can involve knowledge of the 
        numbering plan and/or use of inter-digit timer expiry. 
         
     8.2.1.1 Receipt of QSIG SETUP message 
         
        On receipt of a QSIG SETUP message containing a number that the 
        gateway determines to be complete in the Called party number 
        information element, or containing a Sending complete information 
        element and a number that the gateway cannot determine to be 
        complete, the gateway SHALL map the QSIG SETUP message to a SIP 
        INVITE request. The gateway SHALL also send a QSIG CALL PROCEEDING 
        message. 
         
        The gateway SHALL generate the SIP Request-URI, To and From fields in 
        the SIP INVITE request in accordance with section 9. The gateway 
        SHALL include in the INVITE request a Supported header containing 
        option tag 100rel, to indicate support for RFC 3262. 
         
        The gateway SHALL include SDP information in the SIP INVITE request 
        as described in section 10. 
         
        On receipt of a QSIG SETUP message containing a Sending complete 
        information element and a number that the gateway determines to be 
        incomplete in the Called party number information element, the 
        gateway SHALL initiate QSIG call clearing procedures using cause 
        value 28 ôinvalid number format (address incomplete)ö. 
         
        If information in the QSIG SETUP message is unsuitable for generating 
        any of the mandatory fields in a SIP INVITE request (e.g., if a 
        Request-URI cannot be derived from the QSIG Called party number 
        information element) or for generating SDP information, the gateway 
        SHALL NOT issue a SIP INVITE request and SHALL initiate QSIG call 
        clearing procedures in accordance with ECMA-143. 
         
     8.2.1.2 Receipt of SIP 100 (Trying) response 
         
        A SIP 100 response SHALL NOT trigger any QSIG messages. It only 
        serves the purpose of suppressing INVITE request retransmissions. 
         
     8.2.1.3 Receipt of SIP 18x provisional response 
         
        The gateway SHALL map a received SIP 18x response to a QSIG PROGRESS 
        or ALERTING message based on the following conditions. 
         
        -If a SIP 180 response is received and no QSIG ALERTING message has 
        been sent, the gateway SHALL generate a QSIG ALERTING message. The 
        QSIG ALERTING message SHALL contain a Progress indicator information 
        element containing progress description number 8. If the SDP answer 
      
      
     Elwell et alia         Expires - February 2003              [Page 12] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        has been received, the gateway SHALL connect the media streams to the 
        corresponding user information channel of the inter-PINX link. If the 
        SDP answer has not been received, the gateway SHALL supply ring-back 
        tone on the user information channel of the inter-PINX link. If the 
        SDP answer is subsequently received, the gateway SHALL stop ring-back 
        tone and connect the media streams to the corresponding user 
        information channel of the inter-PINX link. 
         
        -If a SIP 181/182/183 response is received, no QSIG ALERTING message 
        has been sent, no QSIG PROGRESS message containing progress 
        description number 8 has been sent and the SDP answer has been 
        received, the gateway SHALL generate a QSIG PROGRESS message. The 
        QSIG PROGRESS message SHALL contain progress description number 8 in 
        a Progress indicator information element. The gateway SHALL also 
        connect the media streams to the corresponding user information 
        channel of the inter-PINX link. 
         
        -If a SIP 181/182/183 response is received, no QSIG ALERTING message 
        has been sent, no QSIG PROGRESS message containing progress 
        description number 1 or 8 has been sent and the SDP answer has not 
        been received, the gateway SHALL generate a QSIG PROGRESS message. 
        The QSIG PROGRESS message SHALL contain progress description number 1 
        in a Progress indicator information element.  
         
        NOTE. This will ensure that QSIG timer T310 is stopped if running at 
        the Originating PINX. 
         
        In all other scenarios the gateway SHALL NOT map the SIP 18x response 
        to a QSIG message. 
         
        If the SIP 18x response contains a Require header with option tag 
        100rel, the gateway SHALL send back a SIP PRACK request in accordance 
        with RFC 3262. 
         
     8.2.1.4 Receipt of SIP 2xx response 
         
        If the gateway receives a SIP 200 (OK) response as the first SIP 200 
        response to a SIP INVITE request, the gateway SHALL map the SIP 200 
        (OK) response to a QSIG CONNECT message. The gateway SHALL also send 
        a SIP ACK request to acknowledge the 200 (OK) response. The gateway 
        SHALL NOT include any SDP information in the SIP ACK request. If the 
        gateway receives further 200 (OK) responses, it SHALL respond to each 
        in accordance with RFC 3261 and SHALL NOT generate any further QSIG 
        messages. 
         
        The SDP answer will now have been received. The gateway SHALL connect 
        the media streams to the corresponding user-information channel on 
        the inter-PINX link if it has not already done so. 
         
      
      
     Elwell et alia         Expires - February 2003              [Page 13] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        If the SIP 200 (OK) response is received in response to the SIP PRACK 
        request, the gateway SHALL NOT map this message to any QSIG message. 
         
        If the gateway receives a SIP 2xx response other than 200 (OK), the 
        gateway SHALL send a SIP ACK request. 
         
        NOTE. A SIP 200 (OK) response can be received later as a result of a 
        forking proxy. 
         
     8.2.1.5 Receipt of SIP 3xx response 
         
        On receipt of a SIP 3xx response, the gateway SHALL act in accordance 
        with RFC 3261. 
         
        NOTE. This will normally result in sending a new SIP INVITE request. 
         
        Unless the gateway supports the QSIG Call Diversion Supplementary 
        Service, no QSIG message SHALL be sent. The definition of Call 
        Diversion Supplementary Service for QSIG to SIP interworking is 
        beyond the scope of this specification. 
         
     8.2.2 Call establishment from QSIG to SIP using overlap procedures 
         
        SIP uses en-bloc signalling and it is strongly RECOMMENDED to avoid 
        using overlap signalling in a SIP network. A SIP/QSIG gateway dealing 
        with overlap signalling, SHOULD perform a conversion from overlap to 
        en-bloc signalling method using one or more of the following 
        mechanisms: 
         
        -timers; 
         
        -numbering plan information; 
         
        -the presence of a Sending complete information element in a received 
        QSIG INFORMATION message. 
         
        If the gateway performs a conversion from overlap to en-bloc 
        signalling in the SIP network then the procedures defined in 8.2.2.1 
        SHALL apply. 
         
        However, for some applications it might be impossible to avoid using 
        overlap signalling in the SIP network. In this case the procedures 
        defined in 8.2.2.2 SHALL apply. 
         
     8.2.2.1 Enbloc signalling in SIP network 
         
     8.2.2.1.1 Receipt of QSIG SETUP message 
         

      
      
     Elwell et alia         Expires - February 2003              [Page 14] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        On receipt of a QSIG SETUP message containing no Sending complete 
        information element and a number in the Called party number 
        information element that the gateway cannot determine to be complete, 
        the gateway SHALL send back a QSIG SETUP ACKNOWLEDGE message, start 
        QSIG T302 timer and await further number digits. 
         
     8.2.2.1.2 Receipt of QSIG INFORMATION message 
         
        On receipt of each QSIG INFORMATION message containing no Sending 
        complete information element and containing a number that the gateway 
        cannot determine to be complete, timer T302 SHALL be restarted. When 
        T302 expires or a QSIG INFORMATION message containing a Sending 
        complete information element is received the gateway SHALL send a SIP 
        INVITE request as described in 8.2.1.1. The Request-URI and To fields 
        (see section 9) SHALL be generated from the concatenation of 
        information in the Called party number information element in the 
        received QSIG SETUP and INFORMATION messages. The gateway SHALL also 
        send a QSIG CALL PROCEEDING message. 
         
     8.2.2.1.3 Receipt of SIP responses 
         
        SIP responses SHALL be mapped as described in 8.2.1. 
         
     8.2.2.2 Overlap signalling in SIP network 
         
     8.2.2.2.1 Receipt of QSIG SETUP message 
         
        On receipt of a QSIG SETUP message containing no Sending complete 
        information element and a number in the Called party number 
        information element that the gateway cannot determine to be complete, 
        the gateway SHALL send back a QSIG SETUP ACKNOWLEDGE message and 
        start QSIG timer T302. If the QSIG SETUP message contains the minimum 
        number of digits required to route the call in the IP network, the 
        gateway SHALL send a SIP INVITE request as specified in 8.2.1.1. 
        Otherwise the gateway SHALL wait for more digits to arrive in QSIG 
        INFORMATION messages. 
         
     8.2.2.2.2 Receipt of QSIG INFORMATION message 
         
        On receipt of a QSIG INFORMATION message the gateway SHALL restart 
        the QSIG T302 timer. Further behaviour of the gateway SHALL depend on 
        whether or not it has already sent a SIP INVITE request. If the 
        gateway has not sent a SIP INVITE request and it now has the minimum 
        number of digits required to route the call, it SHALL send a SIP 
        INVITE request as specified in 8.2.2.1.2. If the gateway still does 
        not have the minimum number of digits required than it SHALL wait for 
        more QSIG INFORMATION messages to arrive. 
         

      
      
     Elwell et alia         Expires - February 2003              [Page 15] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        If the gateway has already sent one or more SIP INVITE requests, and 
        whether or not final responses to those requests have been received, 
        it SHALL send a new SIP INVITE request with the new digits. The new 
        SIP INVITE request SHALL have the same Call-ID as the first SIP 
        INVITE request sent but SHALL have updated Request-URI and To fields. 
        The updated Request-URI and To fields (see section 9) SHALL be 
        generated from the concatenation of information in the Called party 
        number information element in the received QSIG SETUP and INFORMATION 
        messages. 
         
        NOTE. The first SIP INVITE request and all subsequent SIP INVITE 
        requests sent in this way belong to the same call but to different 
        dialogs. 
         
     8.2.2.2.3 Receipt of SIP 100 (Trying) response 
         
        The requirements of 8.2.1.2 SHALL apply. 
         
     8.2.2.2.4 Receipt of SIP 18x provisional response 
         
        The requirements of 8.2.1.3 SHALL apply. 
         
     8.2.2.2.5 Receipt of SIP 2xx response 
         
        The requirements of 8.2.1.4 SHALL apply. 
         
     8.2.2.2.6 Receipt of SIP 3xx response 
         
        The requirements of 8.2.1.5 SHALL apply. 
         
     8.2.2.2.7 Receipt of a SIP 484 (Address Incomplete) response 
         
        The SIP 484 response indicates that more digits are required to 
        complete the call. On receipt of a SIP 484 response the gateway SHALL 
        send back a SIP ACK request. The gateway SHALL also send a QSIG 
        DISCONNECT message if either of the following conditions apply: 
         
        -T302 expires and all the SIP INVITE requests sent have been answered 
        with a final response other than 200 OK; or 
         
        -a QSIG INFORMATION message containing a Sending complete information 
        element has been received and all the SIP INVITE requests sent have 
        been answered with a final response (other than 200 OK). 
         
        In all other cases the receipt of a SIP 484 response SHALL NOT 
        trigger the sending of any QSIG message. 
         
     8.2.2.2.8 Receipt of a SIP 4xx (except 484), 5xx or 6xx response 
         
      
      
     Elwell et alia         Expires - February 2003              [Page 16] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        If a SIP 4xx (except 484), 5xx or 6xx final response arrives for a 
        pending SIP INVITE transaction, the gateway SHALL send a SIP ACK 
        request. If this occurs before T302 has expired, the gateway shall 
        either send a QSIG DISCONNECT message (8.4.4) or behave as for a SIP 
        484 response (8.2.2.2.7). 
         
     8.2.2.2.9 Receipt of multiple SIP responses 
         
        The responses to all the SIP INVITE requests sent except for the last 
        one are typically SIP 4xx responses (e.g. 484 (Address Incomplete)) 
        that terminate the SIP INVITE transaction. 
         
        However, the gateway can receive a SIP 183 (Session Progress) 
        response with a media description. The media stream will typically 
        contain a message such as "àWe are trying to connect youà ". The 
        issue of receiving different SIP 183 (Session Progress) responses 
        with media descriptions for different SIP INVITE transactions is a 
        gateway concern. The gateway SHOULD decide which media stream (if 
        any) is to be played to the user. 
         
     8.2.2.2.10 Cancelling pending SIP INVITE transactions 
         
        When a gateway sends a new SIP INVITE request containing new digits, 
        it SHOULD NOT send a SIP CANCEL request to cancel a previous SIP 
        INVITE transaction that has not had a final response. This SIP CANCEL 
        request could arrive at an egress gateway before the new SIP INVITE 
        request and trigger premature call clearing.  
         
        NOTE. Previous SIP INVITE transactions can be expected to result in 
        SIP 4xx class responses, which terminate the transaction. 
         
     8.2.2.2.11 SIP INVITE requests reaching multiple gateways 
         
        Each SIP INVITE request sent by a gateway represents a new 
        transaction and hence can be routed differently. For instance, the 
        first SIP INVITE request might be routed to a particular egress 
        gateway and a subsequent SIP INVITE request to another gateway. The 
        result is that both gateways initiate call establishment in the 
        remote network. Since one of the call establishments has an 
        incomplete destination number, it can be expected to fail, having 
        already consumed resources in the remote network. 
         
        To avoid this problem it is RECOMMENDED that all the SIP INVITE 
        requests should follow the same path as the first one. This would 
        however restrict the number of services the SIP network can provide. 
        It would not be possible to route a subsequent SIP INVITE request to 
        an application server just because the previous one was routed in a 
        different way. 
         
      
      
     Elwell et alia         Expires - February 2003              [Page 17] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        This issue should be taken into consideration before using overlap 
        signalling in SIP. If initiating multiple call establishments in the 
        remote network is not acceptable in a particular application, overlap 
        signalling SHOULD NOT be used. 
         
     8.3 Call Establishment from SIP to QSIG 
         
     8.3.1 Receipt of SIP INVITE request for a new call 
         
        On receipt of a SIP INVITE request for a new call, the gateway SHALL 
        generate a QSIG SETUP message from the received SIP INVITE request. 
        The gateway SHALL generate the Called party number and Calling party 
        number information elements in accordance with section 9 and SHALL 
        generate the Bearer capability information element in accordance with 
        section 10. If the gateway can determine that the number placed in 
        the Called party number information element is complete, the gateway 
        MAY include the Sending complete information element. 
         
        NOTE 1. The means by which the gateway determines the number to be 
        complete is an implementation matter. It can involve knowledge of the 
        numbering plan and/or use of the inter-digit timer. 
         
        The gateway SHOULD send a SIP 100 (Trying) response. 
         
        If information in the SIP INVITE request is unsuitable for generating 
        any of the mandatory information elements in a QSIG SETUP message 
        (e.g., if a QSIG Called party number information element cannot be 
        derived from SIP Request-URI field), the gateway SHALL NOT issue a 
        QSIG SETUP message and SHALL send a SIP 4xx, 5xx or 6xx response. 
         
        If the SIP INVITE request does not contain SDP information and does 
        not contain either a Required header or a Supported header with 
        option tag 100rel, the gateway SHALL NOT issue a QSIG SETUP message 
        and SHALL send a SIP 488 (Not Acceptable Here) response. 
         
        NOTE 2. The absence of SDP offer information in the SIP INVITE 
        request means that the gateway might need to send SDP offer 
        information in a provisional response and receive SDP answer 
        information in a SIP PRACK request (in accordance with RFC 3262) in 
        order to ensure that tones and announcements from the PISN are 
        transmitted. SDP offer information cannot be sent in an unreliable 
        provisional response because the SDP answer would need to be returned 
        in a SIP PRACK request. 
         
        NOTE 3. If SDP offer information is present in the INVITE request, 
        the issuing of a QSIG SETUP message is not dependent on the presence 
        of a Required header or a Supported header with option tag 100rel. 
         

      
      
     Elwell et alia         Expires - February 2003              [Page 18] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        On receipt of a SIP INVITE request relating to a call that has 
        already been established from SIP to QSIG, the procedures of 8.3.9 
        SHALL apply. 
         
     8.3.2 Receipt of QSIG CALL PROCEEDING message 
         
        The receipt of a QSIG CALL PROCEEDING message SHALL NOT result in any 
        SIP message being sent. 
         
     8.3.3 Receipt of QSIG PROGRESS message 
         
        A QSIG PROGRESS message can be received in the event of interworking 
        at the egress from the PISN or if the PISN is unable to complete the 
        call and generates an in-band tone or announcement. In the latter 
        case a Cause information element is included in the QSIG PROGRESS 
        message. 
         
        The gateway SHALL map a received QSIG PROGRESS message to a SIP 183 
        (Session Progress) response. If the SIP INVITE request contained 
        either a Require header or a Supported header with option tag 100rel, 
        the gateway SHALL include in the SIP 183 response a Require header 
        with option tag 100rel. 
         
        NOTE. In accordance with RFC 3262, inclusion of option tag 100rel in 
        a provisional response instructs the UAC to acknowledge the 
        provisional response by sending a PRACK request. RFC 3262 also 
        specifies procedures for repeating a provisional response with option 
        tag 100rel if no PRACK is received. 
         
        If the QSIG PROGRESS message contained a Progress indicator 
        information element with Progress description number 1 or 8, the 
        gateway SHALL connect the media streams to the corresponding user 
        information channel of the inter-PINX link if it has not already done 
        so, provided the SDP answer is included in the transmitted SIP 
        response or has already been sent or received. Inclusion of SDP offer 
        or answer information in the 183 provisional response SHALL be in 
        accordance with 8.3.5 
         
        If the QSIG PROGRESS message is received with a Cause information 
        element, the gateway SHALL either wait until the tone/announcement is 
        complete or has been applied for sufficient time before initiating 
        call clearing, or wait for a SIP CANCEL request. If call clearing is 
        initiated, the cause value in the QSIG PROGRESS message SHALL be used 
        to derive the response to the SIP INVITE request in accordance with 
        table 1. 
         
     8.3.4 Receipt of QSIG ALERTING message 
         

      
      
     Elwell et alia         Expires - February 2003              [Page 19] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        The gateway SHALL map a QSIG ALERTING message to a SIP 180 (Ringing) 
        response. If the SIP INVITE request contained either a Require header 
        or a Supported header with option tag 100rel, the gateway SHALL 
        include in the SIP 180 response a Require header with option tag 
        100rel. 
         
        NOTE. In accordance with RFC 3262, inclusion of option tag 100rel in 
        a provisional response instructs the UAC to acknowledge the 
        provisional response by sending a PRACK request. RFC 3262 also 
        specifies procedures for repeating a provisional response with option 
        tag 100rel if no PRACK is received. 
         
        If the QSIG ALERTING message contained a Progress indicator 
        information element with Progress description number 1 or 8, the 
        gateway SHALL connect the media streams to the corresponding user 
        information channel of the inter-PINX link if it has not already done 
        so, provided the SDP answer is included in the transmitted SIP 
        response or has already been sent or received. Inclusion of SDP offer 
        or answer information in the 180 provisional response SHALL be in 
        accordance with 8.3.5 
         
     8.3.5 Inclusion of SDP information in a SIP 18x provisional response 
         
        When sending a SIP 18x provisional response, the gateway SHALL 
        include SDP information in accordance with the following rules. 
         
        If the SIP INVITE request contained a Required or Supported header 
        with option tag 100rel, and if SDP offer and answer have already been 
        exchanged, no SDP SHALL be included in the SIP 18x provisional 
        response. 
         
        If the SIP INVITE request contained a Required or Supported header 
        with option tag 100rel, and if SDP offer was received in the SIP 
        INVITE request but no SDP answer has been sent, SDP answer SHALL be 
        included in the SIP 18x provisional response. 
         
        If the SIP INVITE request contained a Required or Supported header 
        with option tag 100rel, and if no SDP offer was received in the SIP 
        INVITE request and no SDP offer has already been sent, SDP offer 
        SHALL be included in the SIP 18x provisional response. 
         
        NOTE 1. In this case, SDP answer can be expected in the SIP PRACK. 
         
        If the SIP INVITE request contained neither a Required nor a 
        Supported header with option tag 100rel, SDP answer SHALL be included 
        in the SIP 18x provisional response. 
         


      
      
     Elwell et alia         Expires - February 2003              [Page 20] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        NOTE 2. Because the provisional response is unreliable, SDP answer 
        needs to be repeated in each provisional response and in the final 
        SIP 2xx response. 
         
        NOTE 3. If the SIP INVITE request contained no SDP offer and neither 
        a Required nor a Supported header with option tag 100rel, it should 
        have been rejected in accordance with 8.3.1. 
         
     8.3.6 Receipt of QSIG CONNECT message 
         
        The gateway SHALL map a QSIG CONNECT message to a SIP 200 (OK) final 
        response for the SIP INVITE request. The gateway SHALL also send a 
        QSIG CONNECT ACKNOWLEDGE message. 
         
        If the SIP INVITE request contained a Required or Supported header 
        with option tag 100rel, and if SDP offer and answer have already been 
        exchanged, no SDP SHALL be included in the SIP 200 response. 
         
        If the SIP INVITE request contained a Required or Supported header 
        with option tag 100rel, and if SDP offer was received in the SIP 
        INVITE request but no SDP answer has been sent, SDP answer SHALL be 
        included in the SIP 200 response. 
         
        If the SIP INVITE request contained a Required or Supported header 
        with option tag 100rel, and if no SDP offer was received in the SIP 
        INVITE request and no SDP offer has already been sent, SDP offer 
        SHALL be included in the SIP 200 response. 
         
        NOTE 1. In this case, SDP answer can be expected in the SIP ACK. 
         
        If the SIP INVITE request contained neither a Required nor a 
        Supported header with option tag 100rel, SDP answer SHALL be included 
        in the SIP 200 response. 
         
        NOTE 2. Because the provisional response is unreliable, SDP answer 
        needs to be repeated in each provisional response and in the final 
        2xx response. 
         
        NOTE 3. If the SIP INVITE request contained no SDP offer and neither 
        a Required nor a Supported header with option tag 100rel, it should 
        have been rejected in accordance with 8.3.1. 
         
        The gateway SHALL connect the media streams to the corresponding user 
        information channel of the inter-PINX link if it has not already done 
        so, provided the SDP answer is included in the transmitted SIP 
        response or has already been sent or received. 
         
     8.3.7 Receipt of SIP PRACK request 
         
      
      
     Elwell et alia         Expires - February 2003              [Page 21] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        The receipt of a SIP PRACK request acknowledging a reliable 
        provisional response SHALL NOT result in any QSIG message being sent. 
        The gateway SHALL send back a SIP 200 (OK) response to the SIP PRACK 
        request. 
         
        If the SIP PRACK contains SDP answer and a QSIG message containing a 
        Progress indicator information element with progress description 
        number 1 or 8 has been received, the gateway SHALL connect the media 
        streams to the corresponding user information channel of the inter-
        PINX link. 
         
     8.3.8 Receipt of SIP ACK request 
         
        The receipt of a SIP ACK request SHALL NOT result in any QSIG message 
        being sent. 
         
        If the SIP ACK contains SDP answer, the gateway SHALL connect the 
        media streams to the corresponding user information channel of the 
        inter-PINX link if it has not already done so. 
         
     8.3.9 Receipt of a SIP INVITE request for a call already being 
          established 
         
        For a call from SIP using overlap procedures, the gateway will 
        receive multiple SIP INVITE requests that belong to the same call but 
        have different Request-URI and To fields. Each SIP INVITE request 
        belongs to a different dialog. 
         
        If a gateway receives a SIP INVITE request with the same Call-ID as 
        an existing call for which the QSIG state is overlap sending and with 
        updated Request-URI and To fields from which a called party number 
        with a superset of digits can be derived, it SHALL generate a QSIG 
        INFORMATION message using the call reference of the existing QSIG 
        call instead of a new QSIG SETUP message. It SHALL also respond to 
        the SIP INVITE request received previously with a SIP 484 Address 
        Incomplete response. 
         
        If a gateway receives a SIP INVITE request with the same Call-ID as 
        an existing SIP INVITE request for which the gateway has not yet sent 
        a final response and failing to meet the other conditions above 
        concerning overlap sending, the gateway SHALL clear the call by 
        sending back a SIP 485 (Ambiguous) response and a QSIG DISCONNECT 
        message with Cause Value 16 (Normal call clearing). 
         
     8.4 Call clearing 
         
     8.4.1 Receipt of a QSIG DISCONNECT, RELEASE or RELEASE COMPLETE message 
         

      
      
     Elwell et alia         Expires - February 2003              [Page 22] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        On receipt of QSIG DISCONNECT, RELEASE or RELEASE COMPLETE message as 
        the first QSIG call clearing message, gateway behaviour SHALL depend 
        on the state of call establishment. 
         
        1)If the gateway has sent a SIP 200 (OK) response and received a SIP 
        ACK request or has received a SIP 200 (OK) response and sent a SIP 
        ACK request, the gateway SHALL send a SIP BYE request to clear the 
        call. 
         
        2)If the gateway has sent a SIP 200 (OK) response (indicating that 
        call establishment is complete) but not received a SIP ACK request, 
        the gateway SHALL wait until a SIP ACK is received and then send a 
        SIP BYE request to clear the call. 
         
        3)If the gateway has sent a SIP INVITE request and received a SIP 
        provisional response but not a SIP final response, the gateway SHALL 
        send a SIP CANCEL request to clear the call. 
         
        NOTE. In accordance with RFC 3261, if after sending a SIP CANCEL 
        request a SIP 2xx response is received to the SIP INVITE request, the 
        gateway will need to send a SIP BYE request. 
         
        4)If the gateway has sent a SIP INVITE request but received no SIP 
        response, the gateway SHALL NOT send a SIP message. If a SIP final or 
        provisional response is subsequently received, the gateway SHALL then 
        act in accordance with 1, 2 or 3 above respectively. 
         
        5)If the gateway has received a SIP INVITE request but not sent a SIP 
        final response, the gateway SHALL send a SIP final response chosen 
        according to the cause value in the received QSIG message as 
        specified in table 1. SIP response 500 (Server internal error) SHALL 
        be used as the default for cause value not shown in table 1. 
         
        In all cases the gateway SHALL also disconnect media streams, if 
        established, and allow QSIG and SIP signalling to complete in 
        accordance with ECMA-143 and RFC-3261 respectively. 
         
         
        Table 1 û Mapping of QSIG Cause Value to SIP 4xx-6xx responses 
         
         QSIG Cause value               SIP response 
         1 Unallocated number           404 Not found 
         2 No route to specified        404 Not found 
         transit network 
         3 No route to destination      404 Not found 
         16 Normal call clearing        (NOTE 1) 
         17 User busy                   486 Busy here 
         18 No user responding          408 Request timeout 
         19 No answer from the user     480 Temporarily unavailable 
      
      
     Elwell et alia         Expires - February 2003              [Page 23] 
                       Interworking between SIP and QSIG       August 2002 
      
      
         20 Subscriber absent           480 Temporarily unavailable 
         21 Call rejected               603 Decline, if location field 
                                        in Cause information element 
                                        indicates user. Otherwise: 
                                        403 Forbidden 
         22 Number changed              301 Moved permanently, if 
                                        information in diagnostic field 
                                        of Cause information element is 
                                        suitable for generating a SIP 
                                        Contact header. Otherwise: 
                                        410 Gone 
         23 Redirection to new          410 Gone 
         destination 
         27 Destination out of order    502 Bad gateway 
         28 Address incomplete          484 Address incomplete 
         29 Facility rejected           501 Not implemented 
         31 Normal, unspecified         480 Temporarily unavailable 
         34 No circuit/channel          503 Service unavailable 
         available 
         38 Network out of order        503 Service unavailable 
         41 Temporary failure           503 Service unavailable 
         42 Switching equipment         503 Service unavailable 
         congestion 
         47 Resource unavailable,       503 Service unavailable 
         unspecified 
         55 Incoming calls barred       403 Forbidden 
         within CUG 
         57 Bearer capability not       403 Forbidden 
         authorized 
         58 Bearer capability not       503 Service unavailable 
         presently available 
         65 Bearer capability not       488 Not acceptable here (NOTE 
         implemented                    2) 
         69 Requested facility not      501 Not implemented 
         implemented 
         70 Only restricted digital     488 Not acceptable here (NOTE 
         information available          2) 
         79 Service or option not       501 Not implemented 
         implemented, unspecified 
         87 User not member of CUG      403 Forbidden 
         88 Incompatible destination    503 Service unavailable 
         102 Recovery on timer expiry   504 Server time-out 
         
        NOTE 1. A QSIG call clearing message containing cause value 16 will 
        normally result in the sending of a SIP BYE or CANCEL request. 
        However, if a SIP response is to be sent, the default response code 
        should be used. 
         

      
      
     Elwell et alia         Expires - February 2003              [Page 24] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        NOTE 2. The gateway may include a SIP Warning header if diagnostic 
        information in the QSIG Cause information element allows a suitable 
        warning code to be selected. 
         
     8.4.2 Receipt of a SIP BYE request 
         
        On receipt of a SIP BYE request, the gateway SHALL send a QSIG 
        DISCONNECT message with cause value 16 (normal call clearing). The 
        gateway SHALL also disconnect media streams, if established, and 
        allow QSIG and SIP signalling to complete in accordance with ECMA-143 
        and RFC-3261 respectively. 
         
        NOTE. When responding to a SIP BYE request, in accordance with 
        RFC 3261 the gateway is also required to respond to any other 
        outstanding transactions, e.g., with a SIP 487 (Request Terminated) 
        response. This applies in particular if the gateway has not yet 
        returned a final response to the SIP INVITE request. 
         
     8.4.3 Receipt of a SIP CANCEL request 
         
        On receipt of a SIP CANCEL request to clear a call for which the 
        gateway has not sent a SIP final response to the received SIP INVITE 
        request, the gateway SHALL send a QSIG DISCONNECT message with cause 
        value 16 (normal call clearing). The gateway SHALL also disconnect 
        media streams, if established, and allow QSIG and SIP signalling to 
        complete in accordance with ECMA-143 and RFC-3261 respectively. 
         
     8.4.4 Receipt of a SIP 4xx - 6xx response 
         
        On receipt of a SIP final response (4xx-6xx) to a SIP INVITE request, 
        the gateway SHALL transmit a QSIG DISCONNECT message. The cause value 
        in the QSIG DISCONNECT message SHALL be derived from the SIP 4xx-6xx 
        response according to table 2. Cause value 31 (Normal, unspecified) 
        SHALL be used as the default for SIP responses not shown in table 2. 
        The gateway SHALL also disconnect media streams, if established, and 
        allow QSIG and SIP signalling to complete in accordance with ECMA-143 
        and RFC-3261 respectively. 
         
        Table 2 û Mapping of SIP 4xx-6xx responses to QSIG Cause values 
         
     SIP response                        QSIG Cause value 
     400 Bad request                     41 Temporary failure 
     401 Unauthorized                    21 Call rejected (NOTE 1) 
     402 Payment required                21 Call rejected 
     403 Forbidden                       21 (Call rejected) 
     404 Not found                       1 (Unallocated number) 
     405 Method not allowed              63 Service or option 
                                         unavailable, unspecified 
     406 Not acceptable                  79 Service or option not 
      
      
     Elwell et alia         Expires - February 2003              [Page 25] 
                       Interworking between SIP and QSIG       August 2002 
      
      
                                         implemented, unspecified 
     407 Proxy Authentication required   21 Call rejected (NOTE 1) 
     408 Request timeout                 102 Recovery on timer expiry 
     410 Gone                            22 Number changed 
     413 Request entity too large        127 Interworking, unspecified 
                                         (NOTE 2) 
     414 Request-URI too long            127 Interworking, unspecified 
                                         (NOTE 2) 
     415 Unsupported media type          79 Service or option not 
                                         implemented, unspecified (NOTE 
                                         2) 
     416 Unsupported URI scheme          127 Interworking, unspecified 
                                         (NOTE 2) 
     420 Bad extension                   127 Interworking, unspecified 
                                         (NOTE 2) 
     421 Extension required              127 Interworking, unspecified 
                                         (NOTE 2) 
     423 Interval too brief              127 Interworking, unspecified 
                                         (NOTE 2) 
     480 Temporarily unavailable         18 No user responding 
     481 Call/transaction does not exist 41 Temporary failure 
     482 Loop detected                   25 Exchange routing error 
     483 Too many hops                   25 Exchange routing error 
     484 Address incomplete              28 Invalid number format (NOTE 
                                         2) 
     485 Ambiguous                       1  Unallocated Number 
     486 Busy here                       17 User busy 
     487 Request terminated              (NOTE 3) 
     488 Not Acceptable Here             65 Bearer capability not 
                                         implemented or 31 Normal, 
                                         unspecified(NOTE 4) 
     500 Server internal error           41 Temporary failure 
     501 Not implemented                 79 Service or option not 
                                         implemented, unspecified 
     502 Bad gateway                     38 Network out of order 
     503 Service unavailable             41 Temporary failure 
     504 Gateway time-out                102 Recovery on timer expiry 
     505 Version not supported           127 Interworking, unspecified 
                                         (NOTE 2) 
     513 Message too large               127 Interworking, unspecified 
                                         (NOTE 2) 
     600 Busy everywhere                 17 User busy 
     603 Decline                         21 Call rejected 
     604 Does not exist anywhere         1  Unallocated number 
     606 Not acceptable                  65 Bearer capability not 
                                         implemented or 31 Normal, 
                                         unspecified(NOTE 4) 
         

      
      
     Elwell et alia         Expires - February 2003              [Page 26] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        NOTE 1. In some cases, it may be possible for the gateway to provide 
        credentials to the SIP UAS that is rejecting an INVITE due to 
        authorization failure.  If the gateway can authenticate itself, then 
        obviously it should do so and proceed with the call. Only if the 
        gateway cannot authorize itself should the gateway clear the call in 
        the QSIG network with this cause value. 
         
        NOTE 2. If at all possible, the gateway should respond to these 
        protocol errors by remedying unacceptable behavior and attempting to 
        re-originate the session.  Only if this proves impossible should the 
        gateway clear the call in the QSIG network with this cause value. 
         
        NOTE 3. The circumstances in which SIP response code 487 can be 
        expected to arise do not require it to be mapped to a QSIG cause 
        code, since the QSIG call will normally already be cleared or in the 
        process of clearing. If QSIG call clearing does, however, need to be 
        initiated, the default cause value should be used. 
         
        NOTE 4. When the Warning header is present in a SIP 606 or 488 
        message, the warning code should be examined to determine whether it 
        is reasonable to generate cause value 65. This cause value should be 
        generated only if there is a chance that a new call attempt with 
        different content in the Bearer capability information element will 
        avoid the problem. In other circumstances the default cause value 
        should be used. 
         
     8.4.5 Gateway-initiated call clearing 
         
        If the gateway initiates clearing of the QSIG call owing to QSIG 
        timer expiry or QSIG protocol error in accordance with ECMA-143, the 
        gateway SHALL also initiate clearing of the SIP call in accordance 
        with 8.4.1. If this involves the sending of a final response to a SIP 
        INVITE request, the gateway SHALL use response code 408 (Request 
        timeout) or 500 (Server internal error) as appropriate. 
         
        If the gateway initiates clearing of the SIP call owing to SIP timer 
        expiry or SIP protocol error in accordance with RFC 3261, the gateway 
        SHALL also initiate clearing of the QSIG call in accordance with 
        ECMA-143 using cause value 102 (Recovery on timer expiry) or 41 
        (Temporary failure) as appropriate. 
         
     8.5 Request to change media characteristics 
         
        If after a call has been successfully established the gateway 
        receives a SIP INVITE request to change the media characteristics of 
        the call in a way that would be incompatible with the bearer 
        capability in use within the PISN, the gateway SHALL send back a SIP 
        503 (Service unavailable) response and SHALL NOT change the media 
        characteristics of the existing call. 
      
      
     Elwell et alia         Expires - February 2003              [Page 27] 
                       Interworking between SIP and QSIG       August 2002 
      
      
         
     9 Number mapping 
         
        The SIP æToÆ, æRequest-URIÆ and æFromÆ are in the form of Universal 
        Resource Identifiers (URIs). 
         
     9.1 Mapping from SIP to QSIG 
         
        The gateway SHALL map the SIP Request-URI and From header to the QSIG 
        Called and Calling party number information elements respectively. 
        The way in which this is achieved is outside the scope of this 
        specification. 
         
        The gateway SHALL set the Numbering Plan Identification (NPI) and 
        Type of Number (TON) fields in the QSIG Called and Calling party 
        number information elements in accordance with ECMA-155. 
         
        In the QSIG Calling party number information element, unless the 
        gateway performs screening, the screening indicator SHALL be set to 
        "user provided, not screened" (0). Unless the gateway performs 
        presentation restriction, the presentation indicator SHALL be set to 
        "presentation allowed" (0). Support of screening and/or presentation 
        restriction is outside the scope of this specification. 
         
        Unless the gateway has a means of determining the identity of the 
        user that answers a call from QSIG to SIP, the QSIG Connected number 
        information SHALL NOT be generated. 
         
     9.2 Mapping from QSIG to SIP 
         
        The gateway SHALL map the QSIG Called party number information 
        element to the SIP Request-URI and the SIP To header, both of which 
        SHOULD contain the same value. The gateway SHALL map the QSIG Calling 
        party number information element to the SIP From header. The way in 
        which this is achieved is outside the scope of this specification. 
         
        If the Calling party number information element is not received in 
        the QSIG SETUP message or if it does not contain a number or if the 
        presentation indicator has the value "Presentation restricted", the 
        gateway SHALL use its own address to generate the From header. 
         
     10 Requirements for support of basic services 
         
        This document specifies signalling interworking for basic services 
        that provide a bi-directional transfer capability for speech, 
        facsimile and modem media between the two networks. 
         
     10.1 Derivation of QSIG Bearer capability information element 
         
      
      
     Elwell et alia         Expires - February 2003              [Page 28] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        The gateway SHALL generate the Bearer Capability Information Element 
        in the QSIG SETUP message based on the SDP information received along 
        with the SIP INVITE request. If the SIP INVITE request does not 
        contain SDP information or the media type in the SDP is only æaudioÆ 
        then the Bearer capability information element SHALL BE generated 
        according to table 3. Coding of the Bearer capability information 
        element for other media types is outside the scope of this 
        specification. 
         
        Table 3 û Bearer capability encoding for æaudioÆ transfer 
         
     Field                          Value 
     Coding Standard                "CCITT standardized coding" (00) 
     Information transfer           "3,1 kHz audio" (10000) 
     capability 
     Transfer mode                  "circuit mode" (00) 
     Information transfer rate      "64 Kbits/s" (10000) 
     Multiplier                     Octet omitted 
     User information layer 1       Generated by gateway based on 
     protocol                       information of the PISN. Supported 
                                    values are 
                                    "CCITT recommendation G.711 @-law" 
                                    (00010) 
                                    "CCITT recommendation G.711 A-law" 
                                    (00011) 
         
         
     10.2 Derivation of media type in SDP 
         
        The gateway SHALL generate the SDP information to include in the SIP 
        INVITE request based on the Bearer capability information element 
        received in the QSIG SETUP message. The media type included in the 
        SDP SHALL be according to table 4. 
         
        Table 4 û Media type setting in SDP based on Bearer capability 
        information element 
         
     Information transfer capability in          Media type in SDP 
     Bearer capability information element        
                                                  
     "speech" (00000)                            audio 
     "3,1 kHz audio" (10000)                     audio 
     "unrestricted digital information" (01000)  data 
         
         
     11 Security considerations 
         
        The security considerations of RFC 3261 apply. 
         
      
      
     Elwell et alia         Expires - February 2003              [Page 29] 
                       Interworking between SIP and QSIG       August 2002 
      
      
     12 Author's Addresses 
         
        John Elwell 
        Siemens Communications Limited 
        Technology Drive 
        Beeston 
        Nottingham, UK, NG9 1LA 
        email: john.elwell@siemens.com 
         
        Frank Derks 
        Philips Business Communications 
        P.O. Box 32 
        1200 JD, Hilversum 
        The Netherlands 
        email: frank.derks@philips.com 
         
        Olivier Rousseau 
        Alcatel Business Systems 
        32,Avenue Kleber 
        92700 Colombes 
        France 
        email: olivier.rousseau@col.bsf.alcatel.fr  
         
        Patrick Mourot 
        Alcatel Business Systems 
        1,Rue Dr A. Schweitzer 
        67400 Illkirch 
        France 
        email: patrick.mourot@sxb.bsf.alcatel.fr 
         
     13 Normative References 
         
        [1] ECMA-133 "Private Integrated Services Network (PISN û Reference  
        configuration for PISN exchanges (PINX)" (International Standard 
        ISO/IEC 11579-1) 
         
        [2] ECMA-143 "Private Integrated Services Network - Circuit-mode 
        Bearer Services - Inter-Exchange Signalling Procedures and Protocol" 
        (International Standard ISO/IEC 11572) 
         
        [3] ECMA-165 "Private Integrated Services Network - Generic 
        Functional Protocol for the Support of Supplementary Services - 
        Inter-Exchange Signalling Procedures and Protocol" (International 
        Standard ISO/IEC 11582) 
         
        [4] ECMA-307 "Corporate Telecommunication Networks - Signalling  
        Interworking between QSIG and H.323 - Generic Functional Protocol for 
        the Support of Supplementary Services" (International Standard 
        ISO/IEC 21409) 
      
      
     Elwell et alia         Expires - February 2003              [Page 30] 
                       Interworking between SIP and QSIG       August 2002 
      
      
         
        [5] J. Postel, " Transmission Control Protocol", RFC 793. 
         
        [6] J. Postel, "User Datagram Protocol", RFC 768. 
         
        [7] T. Dierks, C.Allen, "The TLS protocol version 1.0", RFC 2246. 
         
        [8] M. Handley, V. Jacobson, "SDP: Session Description Protocol", RFC 
        2327. 
         
        [9] R. Stewart et al., "Stream Control Transmission Protocol" RFC 
        2960. 
         
        [10] J. Rosenberg, H. Schulzrinne, et al., "SIP: Session initiation  
        protocol", RFC 3261, April 2002. 
         
        [11] J. Rosenberg, H. Schulzrinne, "Reliability of Provisional 
        Responses in SIP", RFC 3262. 
         
        [12] J. Rosenberg, H. Schulzrinne, "An Offer/Answer Model with SDP", 
        Work in progress, RFC 3264. 
         
         
         
     Annex A (informative) û Example message sequences 
         
     A.1 Introduction 
         
        This annex shows some typical message sequences that can occur for an 
        interworking between QSIG and SIP. 
         
        NOTE. For all message sequence diagrams, there is no message mapping 
        between QSIG and SIP unless explicitly indicated by dotted lines. 
        Also, if there are no dotted lines connecting two messages, this 
        means that these are independent of each other in terms of the time 
        when they occur. 
         
        NOTE. Numbers prefixing SIP method names and response codes in the  
        diagrams represent sequence numbers.  Messages bearing the same 
        number will have the same value in the CSeq header. 
         
        NOTE. In some circumstances SIP provisional responses (other than 
        100) are sent reliably, resulting in the use of the PRACK method. 
        PRACK requests and responses are not shown in the message sequence 
        diagrams. 
         
     A.2 Message sequences for call establishment from QSIG to SIP 
         

      
      
     Elwell et alia         Expires - February 2003              [Page 31] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        Below are typical message sequences for successful call establishment 
        from QSIG to SIP 
         
                                    .-------------------. 
                                    |                   | 
                                    |     GATEWAY       | 
                PISN                |                   |         IP NETWORK 
                |                  `-----+------+------'                 | 
                |                        |      |                        | 
                |                        |      |                        | 
                |   QSIG SETUP           |      |        1-INVITE        | 
               1|----------------------->|......|----------------------->| 2 
                |                        |      |                        | 
                |                        |      |                        | 
                | QSIG CALL PROCCEEDING  |      |        1-100 TRYING    | 
               3|<-----------------------|      |<-----------------------+ 4 
                |                        |      |                        | 
                |                        |      |                        | 
                |   QSIG ALERTING        |      |        1-180 RINGING   | 
               8|<-----------------------|......|<-----------------------+ 5 
                |                        |      |                        | 
                |                        |      |        2-PRACK         | 
                |                        |      |----------------------->| 6 
                |                        |      |        2-200 OK        | 
                |                        |      |<-----------------------+ 7 
                |                        |      |                        | 
                |   QSIG CONNECT         |      |        1-200 OK        | 
              11|<-----------------------|......|<-----------------------+ 9 
                |                        |      |                        | 
                |   QSIG CONNECT ACK     |      |        1-ACK           | 
              12|----------------------->|      |----------------------->| 10 
                |                        |      |                        | 
                |<======================>|      |<======================>| 
                |        AUDIO           |      |         AUDIO          | 
         
        Figure 3 û Typical message sequence for successful call establishment 
        from QSIG to SIP using enbloc procedures on both QSIG and SIP 
         
        1 The PISN sends a QSIG SETUP message to the gateway to begin a 
        session with a SIP UA 
        2  On receipt of the QSIG SETUP message, the gateway generates a SIP 
        INVITE request and sends it to an appropriate SIP entity in the IP 
        network based on the called number 
        3  The gateway sends a QSIG CALL PROCEEDING message to the PISN - no 
        more QSIG INFORMATION messages will be accepted 
        4  The IP network sends a SIP 100 (Trying) response to the gateway 
        5  The IP network sends a SIP 180 (Ringing) response. 


      
      
     Elwell et alia         Expires - February 2003              [Page 32] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        6  The gateway may send back a SIP PRACK request to the IP network 
        based on the inclusion of a Require header or a Supported header with 
        option tag 100rel in the initial SIP INVITE request 
        7  The IP network sends a SIP 200 (OK) response to the gateway to  
        acknowledge the SIP PRACK request 
        8  The gateway maps this SIP 180 (Ringing) response to a QSIG 
        ALERTING message and sends it to the PISN. 
        9  The IP network sends a SIP 200 (OK) response when the call is  
        answered. 
        10 The gateway sends a SIP ACK request to acknowledge the SIP 200 
        (OK)response. 
        11 The gateway maps this SIP 200 (OK) response to a QSIG CONNECT 
        message and sends it to the PISN. 
        12 The PISN sends a QSIG CONNECT ACKNOWLEDGE message in response to 
        the QSIG CONNECT message. 
         
                               +------------------------+ 
            PISN               |         GATEWAY        |         IP NETWORK 
                               |                        | 
            |  QSIG SETUP      +--------+-------+-------+                 | 
           1|-------------------------->|       |                         | 
            |                           |       |                         | 
            |  QSIG SETUP ACK           |       |                         | 
           2|<--------------------------|       |                         | 
            |                           |       |                         | 
            | QSIG INFORMATION          |       |                         | 
           3|-------------------------->|       |                         | 
            |                           |       |                         | 
            | QSIG INFORMATION          |       |  1-INVITE               | 
          3a|-------------------------->|.......|------------------------>|4 
            | QSIG CALL PROCEEDING      |       |  1-100 TRYING           | 
           5|<--------------------------|       |<------------------------|6 
            |                           |       |                         | 
            | QSIG ALERTING             |       |  1-180 RINGING          | 
          10|<--------------------------|.......|<------------------------|7 
            |                           |       |  2-PRACK                | 
            |                           |       |------------------------>|8 
            |                           |       |  2-200 OK               | 
            |                           |       |<------------------------|9 
            | QSIG CONNECT              |       |  1-200 OK               | 
          13|<--------------------------|.......|<------------------------|11 
            |                           |       |                         | 
            | QSIG CONNECT ACK          |       |  1-ACK                  | 
          14|-------------------------->|       |------------------------>|12 
            |          AUDIO            |       |           AUDIO         | 
            |<=========================>|       |<=======================>| 
         


      
      
     Elwell et alia         Expires - February 2003              [Page 33] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        Figure 4 û Typical message sequence for successful call establishment 
        from QSIG to SIP using overlap receiving on QSIG and enbloc sending 
        on SIP 
         
        1  The PISN sends a QSIG SETUP message to the gateway to begin a 
        session with a SIP UA. The QSIG SETUP message does not contain a 
        Sending Complete information element. 
        2  The gateway sends a QSIG SETUP ACKNOWLEDGE message to the PISN. 
        More digits are expected. 
        3  More digits are sent from the PISN within a QSIG INFORMATION 
        message. 
        3a More digits are sent from the PISN within a QSIG INFORMATION 
        message. The QSIG INFORMATION message contains a Sending Complete 
        information element 
        4  The Gateway generates a SIP INVITE request and sends it to an  
        appropriate SIP entity in the IP network, based on the called number 
        5  The gateway sends a QSIG CALL PROCEEDING message to the PISN - no 
        more QSIG INFORMATION messages will be accepted 
        6  The IP network sends a SIP 100 (Trying) response to the gateway 
        7  The IP network sends a SIP 180 (Ringing) response. 
        8  The gateway may send back a SIP PRACK request to the IP network 
        based on the inclusion of a Require header or a Supported header with 
        option tag 100rel in the initial SIP INVITE request 
        9  The IP network sends a SIP 200 (OK) response to the gateway to  
        acknowledge the SIP PRACK request 
        10 The gateway maps this SIP 180 (Ringing) response to a QSIG 
        ALERTING message and sends it to the PINX. 
        11 The IP network sends a SIP 200 (OK) response when the call is  
        answered. 
        12 The gateway sends an SIP ACK request to acknowledge the SIP 200 
        (OK) response. 
        13 The gateway maps this SIP 200 (OK) response to a QSIG CONNECT 
        message and sends it to the PINX. 
        14 The PISN sends a QSIG CONNECT ACKNOWLEDGE message in response to 
        the QSIG CONNECT message.  
         
                              +----------------------+ 
          PISN                |        GATEWAY       |           IP NETORK 
                              |                      | 
          |  QSIG SETUP       +-------+-------+------+                   | 
        1 |-------------------------->|       |                          | 
          |                           |       |                          | 
          |  QSIG SETUP ACK           |       |                          | 
        2 |<--------------------------|       |                          | 
          |                           |       |                          | 
          | QSIG INFORMATION          |       |                          | 
        3 |-------------------------->|       |                          | 
          | QSIG INFORMATION          |       | 1-INVITE                 | 
        3 |-------------------------->|.......|------------------------->|4 
      
      
     Elwell et alia         Expires - February 2003              [Page 34] 
                       Interworking between SIP and QSIG       August 2002 
      
      
          |                           |       | 1-484                    | 
          |                           |       |<-------------------------|5 
          |                           |       | 1-ACK                    | 
          |                           |       |------------------------->|6 
          | QSIG INFORMATION          |       | 2-INVITE                 | 
        7 |-------------------------->|.......|------------------------->|4 
          |                           |       | 2-484                    | 
          |                           |       |<-------------------------|5 
          |                           |       | 2-ACK                    | 
          |                           |       |------------------------->|6 
          |                           |       |                          | 
          | QSIG INFORMATION          |       |                          | 
          | Sending Complete IE       |       | 3-INVITE                 | 
        8 |-------------------------->|.......|------------------------->|10 
          | QSIG CALL PROCEEDING      |       | 3-100 TRYING             | 
        9 |<--------------------------|       |<-------------------------|11 
          |                           |       |                          | 
          | QSIG ALERTING             |       | 3-180 RINGING            | 
        15|<--------------------------|.......|<-------------------------|12 
          |                           |       | 4-PRACK                  | 
          |                           |       |------------------------->|13 
          |                           |       | 4-200 OK                 | 
          |                           |       |<-------------------------|14
          | QSIG CONNECT              |       | 3-200 OK                 | 
        18|<--------------------------|.......|<-------------------------|16 
          |                           |       |                          | 
          | QSIG CONNECT ACK          |       | 3-ACK                    | 
        19|-------------------------->|       |------------------------->|17 
          |         AUIO              |       |         AUDIO            | 
          |<=========================>|       |<========================>| 
          |                           |       |                          | 
         
        Figure 5 û Typical message sequence for successful call establishment 
        from QSIG to SIP using overlap procedures on both QSIG and SIP 
         
        1  The PISN sends a QSIG SETUP message to the gateway to begin a 
        session with a SIP UA. The QSIG SETUP message does not contain a 
        Sending complete information element. 
        2  The gateway sends a QSIG SETUP ACKNOWLEDGE message to the PISN. 
        More digits are expected. 
        3  More digits are sent from the PISN within a QSIG INFORMATION 
        message.  
        4  When the gateway receives the minimum number of digits required to 
        route the call it generates a SIP INVITE request and sends it to an 
        appropriate SIP entity in the IP network based on the called number 
        5  Due to an insufficient number of digits the IP network will return 
        a SIP 484 (Address Incomplete) response. 
        6  The SIP 484 (Address Incomplete) response is acknowledged. 

      
      
     Elwell et alia         Expires - February 2003              [Page 35] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        7  More digits are received from the PISN in a QSIG INFORMATION 
        message. A new INVITE is sent with the same Call-ID but an updated 
        Request-URI.  
        8  More digits are received from the PISN in a QSIG INFORMATION 
        message. The QSIG INFORMATION message contains a Sending Complete 
        information element  
        9  The gateway sends a QSIG CALL PROCEEDING message to the PISN - no 
        more information will be accepted 
        10 The gateway sends a new SIP INVITE request with an updated 
        Request-URI field. 
        11 The IP network sends a SIP 100 (Trying) response to the gateway 
        12 The IP network sends a SIP 180 (Ringing) response. 
        13 The gateway may send back a SIP PRACK request to the IP network 
        based on the inclusion of a Require header or a Supported header with 
        option tag 100rel in the initial SIP INVITE request 
        14 The IP network sends a SIP 200 (OK) response to the gateway to  
        acknowledge the SIP PRACK request 
        15 The gateway maps this SIP 180 (Ringing) response to a QSIG 
        ALERTING message and sends it to the PISN. 
        16 The IP network sends a SIP 200 (OK) response when the call is  
        answered. 
        17 The gateway sends a SIP ACK request to acknowledge the SIP 200 
        (OK) response. 
        18 The gateway maps this SIP 200 (OK) response to a QSIG CONNECT 
        message. 
        19 The PISN sends a QSIG CONNECT ACKNOWLEDGE message in response to 
        the QSIG CONNECT message.  
         
     A.3 Message sequences for call establishment from SIP to QSIG 
         
        Below are typical message sequences for successful call establishment 
        from SIP to QSIG 
         
                              +----------------------+ 
          IP NETWORK          |        GATEWAY       |                PISN 
                              |                      | 
          |                   +-------+-------+------+                   | 
          |                           |       |                          | 
          |                           |       |                          |
          |     1-INVITE              |       | QSIG SETUP               | 
        1 |-------------------------->|.......|------------------------->|3 
          |     1-100 TRYING          |       | QSIG CALL PROCEEDING     | 
        2 |<--------------------------|       |<-------------------------|4 
          |     1-180 RINGING         |       | QSIG ALERTING            | 
        6 |<--------------------------|.......|<-------------------------|5 
          |                           |       |                          | 
          |                           |       |                          | 
          |     2-PRACK               |       |                          | 
        7 |-------------------------->|       |                          | 
      
      
     Elwell et alia         Expires - February 2003              [Page 36] 
                       Interworking between SIP and QSIG       August 2002 
      
      
          |     2-200 OK              |       |                          | 
        8 |<--------------------------|       |                          | 
          |     1-200 OK              |       | QSIG CONNECT             | 
        11|<--------------------------|.......|<-------------------------|9 
          |                           |       |                          | 
          |     1-ACK                 |       | QSIG CONNECT ACK         | 
        12|-------------------------->|       |------------------------->|10 
          |         AUDIO             |       |         AUDIO            | 
          |<=========================>|       |<========================>| 
          |                           |       |                          | 
         
        Figure 6 û Typical message sequence for successful call establishment 
        from SIP to QSIG using enbloc procedures 
         
        1  The IP network sends a SIP INVITE request to the gateway 
        2  The gateway sends a SIP 100 (Trying) response to the IP network 
        3  On receipt of the SIP INVITE request, the gateway sends a QSIG 
        SETUP message 
        4  The PISN sends a QSIG CALL PROCEEDING message to the gateway 
        5  A QSIG ALERTING message is returned to indicate that the end user 
        in the PISN is being alerted 
        6  The gateway maps the QSIG ALERTING message to a SIP 180 (Ringing) 
        response 
        7  The IP network can send back a SIP PRACK request to the IP network 
        based on the inclusion of a Require header or a Supported header with 
        option tag 100rel in the initial SIP INVITE request 
        8  The gateway sends a SIP 200 (OK) response to acknowledge the SIP 
        PRACK request 
        9  The PISN sends a QSIG CONNECT message to the gateway when the call 
        is answered 
        10 The gateway sends a QSIG CONNECT ACKNOWLEDGE message to 
        acknowledge the QSIG CONNECT message 
        11 The QSIG CONNECT message is mapped to a SIP 200 (OK) response. 
        12 The IP network, upon receiving a SIP INVITE final response (200), 
        will send a SIP ACK request to acknowledge receipt 
         
                              +----------------------+ 
          IP NETWORK          |        GATEWAY       |                PISN 
                              |                      | 
          | 1-INVITE          +-------+-------+------+                   | 
        1 |-------------------------->|       |                          | 
          |     1-484                 |       |                          | 
        2 |<--------------------------|       |                          | 
          |     1-ACK                 |       |                          | 
        3 |-------------------------->|       |                          | 
          |     2-INVITE              |       |                          | 
        1 |-------------------------->|       |                          | 
          |     2-484                 |       |                          | 
        2 |<--------------------------|       |                          | 
      
      
     Elwell et alia         Expires - February 2003              [Page 37] 
                       Interworking between SIP and QSIG       August 2002 
      
      
          |     2- ACK                |       |                          | 
        3 |-------------------------->|       |                          | 
          |     3-INVITE              |       | QSIG SETUP               | 
        4 |-------------------------->|.......|------------------------->|6 
          |     3-100 TRYING          |       | QSIG CALL PROCEEDING     | 
        5 |<--------------------------|       |<-------------------------|7 
          |     3-180 RINGING         |       | QSIG ALERTING            | 
        9 |<--------------------------|.......|<-------------------------|8 
          |                           |       |                          | 
          |                           |       |                          | 
          |     4-PRACK               |       |                          | 
        10|-------------------------->|       |                          | 
          |     5-200 OK              |       |                          | 
        11|<--------------------------|       |                          | 
          |     3-200 OK              |       | QSIG CONNECT             | 
        14|<--------------------------|.......|<-------------------------|12 
          |                           |       |                          | 
          |     3-ACK                 |       | QSIG CONNECT ACK         | 
        15|-------------------------->|       |------------------------->|13 
          |         AUDIO             |       |         AUDIO            | 
          |<=========================>|       |<========================>| 
          |                           |       |                          | 
         
        Figure 7 û Typical message sequence for successful call establishment 
        from SIP to QSIG using overlap receiving on SIP and enbloc sending on 
        QSIG 
         
        1  The IP network sends a SIP INVITE request to the gateway 
        2  Due to an insufficient number of digits the gateway returns a SIP 
        484(Address Incomplete) response. 
        3  The IP network acknowledge the SIP 484 (Address Incomplete) 
        response. 
        4  The IP network sends a new SIP INVITE request with the same Call-
        ID and updated Request-URI.  
        5  The gateway now has all the digits required to route the call to 
        the PISN. The gateway sends back a SIP 100 (Trying) response 
        6  The gateway sends a QSIG SETUP message 
        7  The PISN sends a QSIG CALL PROCEEDING message to the gateway 
        8  A QSIG ALERTING message is returned to indicate that the end user 
        in the PISN is being alerted 
        9  The gateway maps the QSIG ALERTING message to a SIP 180 
        (Ringing)response 
        10 The IP network can send back a SIP PRACK request to the IP network 
        based on the inclusion of a Require header or a Supported header with 
        option tag 100rel in the initial SIP INVITE request 
        11 The gateway sends a SIP 200 (OK) response to acknowledge the SIP 
        PRACK request 
        12 The PISN sends a QSIG CONNECT message to the gateway when the call 
        is answered 
      
      
     Elwell et alia         Expires - February 2003              [Page 38] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        13 The gateway sends a QSIG CONNECT ACKNOWLEDGE message to 
        acknowledge the CONNECT message 
        14 The QSIG CONNECT message is mapped to a SIP 200 (OK) response. 
        15 The IP network, upon receiving a SIP INVITE final response (200), 
        will send a SIP ACK request to acknowledge receipt 
         
                              +----------------------+ 
          IP NETWORK          |        GATEWAY       |                PISN 
                              |                      | 
          | 1-INVITE          +-------+-------+------+                   | 
        1 |-------------------------->|       |                          | 
          |     1-484                 |       |                          | 
        2 |<--------------------------|       |                          | 
          |     1-ACK                 |       |                          | 
        3 |-------------------------->|       |                          | 
          |     2-INVITE              |       | QSIG SETUP               | 
        4 |-------------------------->|.......|------------------------->|6 
          |     2-100 TRYING          |       | QSIG SETUP ACK           | 
        5 |<--------------------------|       |<-------------------------|7 
          |     3- INVITE             |       | QSIG INFORMATION         | 
        8 |-------------------------->|.......|------------------------->|10 
          |     3-100 TRYING          |       |                          | 
        9 |<--------------------------|       | QSIG CALL PROCEEDING     | 
          |                           |       |<-------------------------|11 
        13|     3-180 RINGING         |       | QSIG ALERTING            | 
          |<--------------------------|.......|<-------------------------|12 
          |     2-484                 |       |                          | 
        14|<--------------------------|       |                          | 
          |     2-ACK                 |       |                          | 
        15|-------------------------->|       |                          | 
          |     4-PRACK               |       |                          | 
        16|-------------------------->|       |                          | 
          |     4-200 OK              |       |                          | 
        17|<--------------------------|       |                          | 
          |     3-200 OK              |       | QSIG CONNECT             | 
        20|<--------------------------|.......|<-------------------------|18 
          |                           |       |                          | 
          |     3-ACK                 |       | QSIG CONNECT ACK         | 
        21|-------------------------->|       |------------------------->|19 
          |         AUDIO             |       |         AUDIO            | 
          |<=========================>|       |<========================>| 
          |                           |       |                          | 
         
        Figure 8 û Typical message sequence for successful call establishment 
        from SIP to QSIG using overlap procedures on both SIP and QSIG 
         
        1  The IP network sends a SIP INVITE request to the gateway 
        2  Due to an insufficient number of digits the gateway returns a SIP 
        484(Address Incomplete) response. 
      
      
     Elwell et alia         Expires - February 2003              [Page 39] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        3  The IP network acknowledge the SIP 484 (Address Incomplete) 
        response. 
        4  The IP network sends a new SIP INVITE request with the same Call-
        ID and updated Request-URI.  
        5  The gateway now has all the digits required to route the call to 
        the PISN. The gateway sends back a SIP 100 (Trying) response to the 
        IP network 
        6  The gateway sends a QSIG SETUP message 
        7  The PISN needs more digits to route the call and sends a QSIG 
        SETUP ACKNOWLEDGE message to the gateway 
        8  The IP network sends a new SIP INVITE request with the same Call-
        ID and updated Request-URI. 
        9  The gateway sends back a SIP 100 (Trying) response to the IP 
        network 
        10 The gateway maps the new SIP INVITE request to a QSIG INFORMATION 
        message 
        11 The PISN has all the digits required and sends back a QSIG CALL  
        PROCEEDING message to the gateway 
        12 A QSIG ALERTING message is returned to indicate that the end user 
        in the PISN is being alerted 
        13 The gateway maps the QSIG ALERTING message to a SIP 180 
        (Ringing)response 
        14 The gateway sends a SIP 484 (Address Incomplete) response for the 
        previous SIP INVITE request 
        15 The IP network acknowledges the SIP 484 (Address Incomplete) 
        response 
        16 The IP network can send back a SIP PRACK request to the IP network 
        based on the inclusion of a Require header or a Supported header with 
        option tag 100rel in the initial SIP INVITE request 
        17 The gateway sends a SIP 200 (OK) response to acknowledge the SIP 
        PRACK request 
        18 The PISN sends a QSIG CONNECT message to the gateway when the call 
        is answered 
        19 The gateway sends a QSIG CONNECT ACKNOWLEDGE message to 
        acknowledge the QSIG CONNECT message 
        20 The QSIG CONNECT message is mapped to a SIP 200 (OK) response. 
        21 The IP network, upon receiving a SIP INVITE final response (200), 
        will send a SIP ACK request to acknowledge receipt 
         
     A.4 Message sequence for call clearing from QSIG to SIP 
         
        Below are typical message sequences for Call Clearing from QSIG to 
        SIP 
         
                                      .-------------------. 
                                      |                   | 
                                      |     GATEWAY       | 
                  PISN                |                   |         IP 
        NETWORK 
      
      
     Elwell et alia         Expires - February 2003              [Page 40] 
                       Interworking between SIP and QSIG       August 2002 
      
      
                   |                  `-----+------+------'                 | 
                   |                        |      |                        | 
                   |                        |      |                        | 
                   |     QSIG DISCONNECT    |      |   2- BYE               | 
                  1|----------------------->|......|-----------------------
        >|4 
                   |     QSIG RELEASE       |      |        2-200 OK        | 
                  2|<-----------------------|      |<-----------------------
        |5 
                   |     QSIG RELEASE COMP  |      |                        | 
                  3|----------------------->|      |                        | 
                   |                        |      |                        | 
                   |                        |      |                        | 
                   |                        |      |                        | 
         
        Figure 9 û Typical message sequence for call clearing from QSIG to 
        SIP subsequent to call establishment 
         
        1  The PISN sends a QSIG DISCONNECT message to the gateway 
        2  The gateway sends back a QSIG RELEASE message to the PISN in 
        response to the QSIG DISCONNECT message 
        3  The PISN sends a QSIG RELEASE COMPLETE message in response. All 
        PISN resources are now released. 
        4  The gateway maps the QSIG DISCONNECT message to a SIP BYE request 
        5  The IP network sends back a SIP 200 (OK) response to the SIP BYE  
        request. All IP resources are now released 
         
                                   .-------------------. 
                                   |                   | 
                                   |     GATEWAY       | 
               PISN                |                   |         IP NETWORK 
                |                  `-----+------+------'                 | 
                |                        |      |                        | 
                |                        |      |                        | 
                |     QSIG DISCONNECT    |      |   1- 4XX / 6XX         | 
               1|----------------------->|......|----------------------->|4 
                |     QSIG RELEASE       |      |        1- ACK          | 
               2|<-----------------------|      |<-----------------------|5 
                |     QSIG RELEASE COMP  |      |                        | 
               3|----------------------->|      |                        | 
                |                        |      |                        | 
                |                        |      |                        | 
         
        Figure 10 û Typical message sequence for call clearing from QSIG to 
        SIP during establishment of a call from SIP to QSIG (gateway has not 
        sent a final response to the SIP INVITE request) 
         
        1  The PISN sends a QSIG DISCONNECT message to the gateway 

      
      
     Elwell et alia         Expires - February 2003              [Page 41] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        2  The gateway sends back a QSIG RELEASE message to the PISN in 
        response to the QSIG DISCONNECT message 
        3  The PISN sends a QSIG RELEASE COMPLETE message in response. All 
        PISN resources are now released. 
        4  The gateway maps the QSIG DISCONNECT message to a SIP 4xx-6xx 
        response 
        5  The IP network sends back a SIP ACK request in response to the SIP 
        4xx-6xx response. All IP resources are now released 
         
                                   .-------------------. 
                                   |                   | 
                                   |     GATEWAY       | 
               PISN                |                   |         IP NETWORK 
                |                  `-----+------+------'                 | 
                |                        |      |                        | 
                |                        |      |                        | 
                |     QSIG DISCONNECT    |      |   1- CANCEL            | 
               1|----------------------->|......|----------------------->|4 
                |     QSIG RELEASE       |      |1-487 Request Terminated| 
               2|<-----------------------|      |<-----------------------|5 
                |     QSIG RELEASE COMP  |      |                        | 
               3|----------------------->|      |   1- 200 OK            | 
                |                        |      |<-----------------------|6 
                |                        |      |                        | 
                |                        |      |                        | 
         
        Figure 11 û Typical message sequence for call clearing from QSIG to 
        SIP during establishment of a call from QSIG to SIP (gateway has 
        received a provisional response to the SIP INVITE request but not a 
        final response) 
         
        1  The PISN sends a QSIG DISCONNECT message to the gateway 
        2  The gateway sends back a QSIG RELEASE message to the PISN in 
        response to the QSIG DISCONNECT message 
        3  The PISN sends a QSIG RELEASE COMPLETE message in response. All 
        PISN resources are now released. 
        4  The gateway maps the QSIG DISCONNECT message to a SIP CANCEL 
        request(subject to a provisional response but no final response 
        having been received) 
        5  The IP network sends back a SIP 487 (Request Terminated) response 
        to the SIP INVITE request. 
        6  The IP network sends back a SIP 200 (OK) response to the SIP 
        CANCEL request. All IP resources are now released 
         
     A.5 Message sequence for call clearing from SIP to QSIG 

        Below are typical message sequences for Call Clearing from SIP to 
        QSIG 
         
      
      
     Elwell et alia         Expires - February 2003              [Page 42] 
                       Interworking between SIP and QSIG       August 2002 
      
      
                                   .-------------------. 
                                   |                   | 
                                   |     GATEWAY       | 
               IP NETWORK          |                   |              PISN 
                |                  `-----+------+------'                 | 
                |                        |      |                        | 
                |                        |      |                        | 
                |   2- BYE               |      |     QSIG DISCONNECT    | 
               1|----------------------->|......|----------------------->|3 
                |                        |      |     QSIG RELEASE       | 
                |                        |      |<-----------------------|4 
                |        2-200 OK        |      |     QSIG RELEASE COMP  | 
               2|<-----------------------|      |----------------------->|5 
                |                        |      |                        | 
                |                        |      |                        | 
         
        Figure 12 û Typical message sequence for call clearing from SIP to 
        QSIG subsequent to call establishment 
         
        1  The IP network sends a SIP BYE request to the gateway 
        2  The gateway sends back a SIP 200 (OK) response to the SIP BYE 
        request. All IP resources are now released  
        3  The gateway maps the SIP BYE request to a QSIG DISCONNECT message 
        4  The PISN sends back a QSIG RELEASE message to the gateway in 
        response to the QSIG DISCONNECT message  
        5  The gateway sends a QSIG RELEASE COMPLETE message in response. All 
        PISN resources are now released. 
         
                                   .-------------------. 
                                   |                   | 
                                   |     GATEWAY       | 
               IP NETWORK          |                   |              PISN 
                |                  `-----+------+------'                 | 
                |                        |      |                        | 
                |                        |      |                        | 
                |   1- 4XX / 6XX         |      |     QSIG DISCONNECT    | 
               1|----------------------->|......|----------------------->|3 
                |                        |      |     QSIG RELEASE       | 
                |                        |      |<-----------------------|4 
                |        1- ACK          |      |     QSIG RELEASE COMP  | 
               2|<-----------------------|      |----------------------->|5 
                |                        |      |                        | 
                |                        |      |                        | 
                |                        |      |                        | 
         
        Figure 13 û Typical message sequence for call clearing from SIP to 
        QSIG during establishment of a call from QSIG to SIP (gateway has not 
        previously received a final response to the SIP INVITE request) 
         
      
      
     Elwell et alia         Expires - February 2003              [Page 43] 
                       Interworking between SIP and QSIG       August 2002 
      
      
        1  The IP network sends a SIP 4xx-6xx response to the gateway 
        2  The gateway sends back a SIPACK request in response to the SIP 
        4xx-6xx response. All IP resources are now released  
        3  The gateway maps the SIP 4xx-6xx response to a QSIG DISCONNECT 
        message 
        4  The PISN sends back a QSIG RELEASE message to the gateway in 
        response to the QSIG DISCONNECT message  
        5  The gateway sends a QSIG RELEASE COMPLETE message in response. All 
        PISN resources are now released. 
         
                                   .-------------------. 
                                   |                   | 
                                   |     GATEWAY       | 
               IP NETWORK          |                   |              PISN 
                |                  `-----+------+------'                 | 
                |                        |      |                        | 
                |                        |      |                        | 
                |   1- CANCEL            |      |     QSIG DISCONNECT    | 
               1|----------------------->|......|----------------------->|4 
                |                        |      |     QSIG RELEASE       | 
                |                        |      |<-----------------------|5 
                |1-487 Request Terminated|      |     QSIG RELEASE COMP  | 
               2|<-----------------------|      |----------------------->|6 
                |                        |      |                        | 
                |   1- 200 OK            |      |                        | 
               3|<-----------------------|      |                        | 
         
        Figure 14 û Typical message sequence for call clearing from SIP to 
        QSIG during establishment of a call from QSIG to SIP (gateway has 
        received a provisional response to the SIP INVITE request but not a 
        final response) 
         
        1  The IP network sends a SIP CANCEL request to the gateway 
        2  The gateway sends back a SIP 487 (Request Terminated) response to 
        the SIP INVITE request 
        3  The gateway sends back a SIP 200 (OK) response to the SIP CANCEL  
        request. All IP resources are now released 
        4  The gateway maps the SIP 4xx-6xx response to a QSIG DISCONNECT 
        message 
        5  The PISN sends back a QSIG RELEASE message to the gateway in 
        response to the QSIG DISCONNECT message  
        6  The gateway sends a QSIG RELEASE COMPLETE message in response. All 
        PISN resources are now released. 
         
         
        Annex B (temporary) û Change log 
         
        Compared with draft-elwell-sipping-qsig2sip-01 the following changes 
        have been made, reflecting discussions during IETF54: 
      
      
     Elwell et alia         Expires - February 2003              [Page 44] 
                       Interworking between SIP and QSIG       August 2002 
      
      
         
        - removal of references to Q reference point in section 1; 
        - mention in section 1 of possible future work on supplementary 
        services such as call transfer and call diversion; 
        - addition of background material to section 5; 
        - additional descriptive material in overview (section 6); 
        - changes to cause/response code mappings in 8.4.1 and 8.4.4 to 
        achieve greater alignment with draft-ietf-sipping-isup; 
        - addition of note concerning PRACK in A.1. 
         
         






































      
      
     Elwell et alia         Expires - February 2003              [Page 45] 
